Управление_пожарной_частью_/src/Documents/ПланСдачиНормативов/ПланСдачиНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланСдачиНормативов</name>
  <registerRecords>InformationRegister.КонтрольныеЗначенияУпражнений</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Караул</name>
    <type>
      <types>CatalogRef.ГруппаСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТренировки</name>
    <type>
      <types>CatalogRef.ТипТренировки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>CatalogRef.МестоПроведенияТренировки</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальникКараула</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Инструктор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Упражнения</name>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Норматив</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>EnumRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/Documents/ПланСдачиНормативов/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПланСдачиНормативов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланСдачиНормативов.Дата,
	|	ПланСдачиНормативов.Инструктор,
	|	ПланСдачиНормативов.Караул,
	|	ПланСдачиНормативов.МестоПроведения,
	|	ПланСдачиНормативов.НачальникКараула,
	|	ПланСдачиНормативов.Номер,
	|	ПланСдачиНормативов.Организация,
	|	ПланСдачиНормативов.ТипТренировки,
	|	ПланСдачиНормативов.Упражнения.(
	|		НомерСтроки,
	|		Норматив
	|	),
	|	ПланСдачиНормативов.Сотрудники.(
	|		НомерСтроки,
	|		Сотрудник,
	|		Должность
	|	)
	|ИЗ
	|	Документ.ПланСдачиНормативов КАК ПланСдачиНормативов
	|ГДЕ
	|	ПланСдачиНормативов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУпражненияШапка = Макет.ПолучитьОбласть("УпражненияШапка");
	ОбластьУпражнения = Макет.ПолучитьОбласть("Упражнения");
	ОбластьСотрудникиШапка = Макет.ПолучитьОбласть("СотрудникиШапка");
	ОбластьСотрудники = Макет.ПолучитьОбласть("Сотрудники");
	Подвал = Макет.ПолучитьОбласть("Подвал");
    Подпись = Макет.ПолучитьОбласть("Подпись");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьУпражненияШапка);
		ВыборкаУпражнения = Выборка.Упражнения.Выбрать();
		Пока ВыборкаУпражнения.Следующий() Цикл
			ОбластьУпражнения.Параметры.Заполнить(ВыборкаУпражнения);
			ТабДок.Вывести(ОбластьУпражнения, ВыборкаУпражнения.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьСотрудникиШапка);
		ВыборкаСотрудники = Выборка.Сотрудники.Выбрать();
		Пока ВыборкаСотрудники.Следующий() Цикл
			ОбластьСотрудники.Параметры.Заполнить(ВыборкаСотрудники);
			ТабДок.Вывести(ОбластьСотрудники, ВыборкаСотрудники.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
        ТабДок.Вывести(Подпись);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
